# Parameters
nc: 1  # number of classes
scales: # model scaling constants
  # [depth, width, max_channels]
  n: [0.33, 0.25, 1024] 
  m: [0.67, 0.75, 768]   
  l: [1.00, 1.00, 512]   
  x: [1.00, 1.25, 512]   
 
# YOLO-AMC GAM backbone
backbone:
  - [-1, 1, Conv, [64, 3, 2]]        # 0-P1/2
  - [-1, 1, Conv, [128, 3, 2]]       # 1-P2/4
  - [-1, 2, C3k2, [256, False, 0.25]] # 2
  - [-1, 1, Conv, [256, 3, 2]]       # 3-P3/8
  - [-1, 2, C3k2, [512, False, 0.25]] # 4
  - [-1, 1, Conv, [512, 3, 2]]       # 5-P4/16
  - [-1, 2, C3k2, [512, True]]       # 6
  - [-1, 1, Conv, [1024, 3, 2]]      # 7-P5/32
  - [-1, 2, C3k2, [1024, True]]      # 8
  - [-1, 1, SPPF, [1024, 5]]         # 9

# YOLO-AMC GAM head
head:
  - [-1, 1, nn.Upsample, [None, 2, 'nearest']] # 10
  - [[-1, 6], 1, Concat, [1]]                  # 11 cat backbone P4
  - [-1, 2, C3k2, [512, False]]                # 12
  - [-1, 1, GAM_Attention, [512, 512]]         # 13 A1 / P4 feature

  - [-1, 1, nn.Upsample, [None, 2, 'nearest']] # 14
  - [[-1, 4], 1, Concat, [1]]                  # 15 cat backbone P3
  - [-1, 2, C3k2, [256, False]]                # 16
  - [-1, 1, GAM_Attention, [256, 256]]         # 17 A2 / P3 output

  - [-1, 1, Conv, [256, 3, 2]]                 # 18
  - [[-1, 13], 1, Concat, [1]]                 # 19 cat head P4 after GAM
  - [-1, 2, C3k2, [512, False]]                # 20
  - [-1, 1, GAM_Attention, [512, 512]]         # 21 A3 / P4 output

  - [-1, 1, Conv, [512, 3, 2]]                 # 22
  - [[-1, 9], 1, Concat, [1]]                  # 23 cat backbone P5
  - [-1, 2, C3k2, [1024, True]]                # 24
  - [-1, 1, GAM_Attention, [1024, 1024]]       # 25 A4 / P5 output

  - [[17, 21, 25], 1, Detect, [nc]]            # 26 Detect(P3, P4, P5)
